Repository: SymKit/redirect-bundle
Catalog: translations/SymkitRedirectBundle.*.xlf
Languages: fr

# admin.page_title.list
source: Redirects
fr: Redirections

# admin.page_description.list
source: Manage URL redirects.
fr: Gérer les redirections d’URL.

# admin.page_title.create
source: Create Redirect
fr: Créer une redirection

# admin.page_description.create
source: Create a new URL redirect.
fr: Créer une nouvelle redirection d’URL.

# admin.page_title.edit
source: Edit Redirect
fr: Modifier la redirection

# admin.page_description.edit
source: Update redirect settings.
fr: Modifier les paramètres de la redirection.

# admin.field.created
source: Created
fr: Créé le

# form.section.general
source: General
fr: Général

# form.section.general_description
source: Define the redirection source and destination.
fr: Définir la source et la destination de la redirection.

# form.field.url_from
source: From URL
fr: URL de départ

# form.field.url_from_placeholder
source: /old-path
fr: /ancien-chemin

# form.field.url_from_help
source: Relative source URL starting with a slash (e.g., /old-page).
fr: URL source relative commençant par un slash (ex. /ancienne-page).

# form.field.url_to
source: External URL
fr: URL externe

# form.field.url_to_placeholder
source: /new-path
fr: /nouveau-chemin

# form.field.url_to_help
source: Relative destination URL (e.g., /new-page).
fr: URL de destination relative (ex. /nouvelle-page).

# form.field.route
source: Internal Route
fr: Route interne

# form.field.route_placeholder
source: -- Select a route --
fr: -- Choisir une route --

# form.field.route_help
source: Select an existing internal route as destination.
fr: Choisir une route interne existante comme destination.

# redirect.unique_pair
source: This redirect source and destination pair already exists.
fr: Cette combinaison source et destination existe déjà.

# redirect.unique_source
source: This source URL is already being redirected.
fr: Cette URL source est déjà redirigée.

# redirect.url_slash
source: The URL must be relative and start with a slash (e.g. /my-page)
fr: L’URL doit être relative et commencer par un slash (ex. /ma-page)

# redirect.destination_different
source: The destination URL cannot be the same as the source URL.
fr: L’URL de destination ne peut pas être identique à l’URL source.

# redirect.destination_required
source: You must provide either a destination URL or a target route.
fr: Vous devez renseigner une URL de destination ou une route cible.

# search.category
source: Redirects
fr: Redirections

# crud.field.destination_no_destination
source: No destination
fr: Aucune destination
